# Y Field

---
C#Visual BasicVisual C++
Revit 2024 API
---
CloudPoint..::..Y Field
CloudPoint Structure See Also
---
The Y coordinate
**Namespace:** Autodesk.Revit.DB.PointClouds**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public float Y
```

Visual Basic
---
```text
Public Y As Single
```

Visual C++
---
```text
public:
float Y
```

# See Also
CloudPoint Structure
Autodesk.Revit.DB.PointClouds Namespace